InformationRegisters/КР_ИдентификаторыСинхронизируемыхОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КР_ИдентификаторыСинхронизируемыхОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СвязьПоТексту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстовоеПредставлениеИдентификатора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КР_ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КР_ИдентификаторыСинхронизируемыхОбъектов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
////////////////////////////////////////////////////
//// Модуль формы записи регистра сведений "КР_ИдентификаторыСинхронизируемыхОбъектов"
//// Создан: 15.12.2022 Марченко С.Н., КРОК, JIRA№A2105505-918
//// Разработка по ФДР С71.004 Интеграция УТ 10.3 Логистика - УТ 11, КритичныйПоступления и ГТД импорт

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
		
КонецПроцедуры  

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьДоступностьЭлементовФормы();
		
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СвязьПоТекстуПриИзменении(Элемент)
	
	Если Запись.СвязьПоТексту Тогда 
		Запись.Идентификатор = Неопределено;    
	Иначе 
		Запись.ТекстовоеПредставлениеИдентификатора = Неопределено;    
	КонецЕсли;
	
	УстановитьВидимостьДоступностьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстовоеПредставлениеИдентификатораПриИзменении(Элемент)
	
	СформироватьИдентификаторПоТекстовомуПредставлению();
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура УстановитьВидимостьДоступностьЭлементовФормы()
	
	Элементы.ТекстовоеПредставлениеИдентификатора.Видимость = Запись.СвязьПоТексту;
	Элементы.Идентификатор.Доступность = Не Запись.СвязьПоТексту;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьИдентификаторПоТекстовомуПредставлению()
	
	Если ПустаяСтрока(Запись.ТекстовоеПредставлениеИдентификатора) Тогда 
		Запись.Идентификатор = Неопределено;
		Возврат;	
	КонецЕсли;	
	
	Запись.Идентификатор = КР_ОбщегоНазначениеСервер.GUIDИзСтроки(
		Запись.ТекстовоеПредставлениеИдентификатора);
		
КонецПроцедуры

#КонецОбласти
